app/controllers/albums_controller.rb

  def index
    @albums = Album.paginate :include => [:composer, :solist, :orchestra, :obra_type, :director], :page => params[:page], :order => 'name'
---
SELECT * FROM "albums"