app/controllers/composers_controller.rb

SELECT * FROM "composers" WHERE (first_name LIKE '%%' AND last_name LIKE '%%') ORDER BY last_name
---
  def index
    @composers = Composer.paginate :page => params[:page], :order => :name

UPDATE "composers" SET "updated_at" = '2009-05-03 22:14:32', "last_name" = 'Adolphe', "nationality" = '', "first_name" = 'Adam' WHERE "id" = 6
---
  def update
    respond_to do |format|
      if @composer.update_attributes(params[:composer])

INSERT INTO "composers" ("name", "updated_at", "birthDate", "deathDate", "nationality", "created_at") VALUES('Fer938', '2009-03-24 21:54:40', '1750-03-24 00:00:00', '1750-03-24 00:00:00', 'Pepponm', '2009-03-24 21:54:40')
---
  def create
    @composer = Composer.new(params[:composer])

    respond_to do |format|
      if @composer.save

DELETE FROM "composers" WHERE "id" = 3
---
  def destroy
    @composer.destroy

SELECT * FROM "composers" WHERE (first_name LIKE '%ad%' OR last_name LIKE '%ad%') ORDER BY last_name
---
  def composers_completion
    matches = Composer.find_by_name_like(params[:prefix])

SELECT * FROM "composers" WHERE ("composers"."id" = 6)
---
    def find_composer
      @composer = Composer.find(params[:id])