app/controllers/directors_controller.rb

SELECT * FROM "directors" WHERE (name like '%%') ORDER BY name
---
  def index
    @directors = Directors.find(:all)