app/controllers/instruments_controller.rb

SELECT * FROM "instruments" WHERE (name like '%%') ORDER BY name
---
  def index
    @instruments = Instrument.paginate :page => params[:page], :order => :name