app/controllers/obra_types_controller.rb

SELECT * FROM "obra_types" WHERE (name like '%%') ORDER BY name
---
  def index
    @obra_types = ObraType.find_by_name_like params[:search]