app/controllers/orchestras_controller.rb

  def index
    @orchestras = Orchestra.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])
---
SELECT * FROM "orchestras" WHERE (name like '%%') ORDER BY name