app/controllers/solists_controller.rb

SELECT * FROM "solists" WHERE (name like '%adam%') ORDER BY name
---
  def index
    @solists = Solist.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}%"])